# 2) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი.
# შემდეგ:
# თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
# თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
#  სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის."


age = int (input (" enter your age: "))
students_card = input(" enter if you have students card: ")

if age < 18 or students_card == "yes":
    print("დანაზოგი გაქვს!")

if age >= 60 and students_card == "no":
    print("პენსიონერის ფასდაკლება გაქვს!")

else:
    print("ფასდაკლება არ გეკუთვნის.")
