# 2)მოხმარებელი შეიყვანს საკუთარ ასაკს და წონას.პროგრამამ უნდა შეაფასოს წონა ასაკის მიხედვით მარტივი ლოგიკით:
# თუ ასაკი < 10:
# წონა < 20 → "წონა დაბალია"
# წონა 20-40 → "წონა ნორმალურია"
# წონა > 40 → "წონა მაღალია"

# თუ ასაკი 10-17:
# წონა < 40 → "წონა დაბალია"
# წონა 40-65 → "წონა ნორმალურია"
# წონა > 65 → "წონა მაღალია"

# თუ ასაკი 18 ან მეტი:
# წონა < 50 → "წონა დაბალია"
# წონა 50-90 → "წონა ნორმალურია"
# წონა > 90 → "წონა მაღალია"


age = int(input(" Enter your age: "))
weight = int(input(" Enter your weight: "))


if age <= 10:
    if weight < 20:
        print("წონა ნაკლებია")
    elif weight <=40:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")


        
if age <= 17:
    if weight < 40:
        print("წონა ნაკლებია")
    elif weight <= 65:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")




if age >= 18:
    if weight < 50:
        print("წონა ნაკლებია")
    elif weight <= 90:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")