# 4) მომხმარებელი შეიყვანს თავის ასაკს და გულის ცემას.
# პროგრამამ უნდა დაარიგოს ასეთი რჩევები:
# ასაკი < 30 და გულისცემა < 140 → "შეგიძლიათ მეტი ივარჯიშოთ"
# ასაკი ≥ 30 და გულისცემა > 170 → "დასვენება გჭირდებათ"
# სხვა შემთხვევაში → "აქტივობის დონე ნორმალურია"

age = int(input(" Enter your age: "))
pulse = int(input("enter your pulse: "))

if age < 30 and pulse < 140:
    print("შეგიძლიათ მეტი ივარჯიშოთ")
elif age >=  30 and pulse > 170:
    print("დასვენება გჭირდებათ")
else:
    print("აქტივობის დონე ნორმალურია")