// მოცემული კოდის გაშვების გარეშე დაწერე შედეგი და ახსენი კომენტარებით რატომ მიიღე ეს შედეგი:

const user = {
    name: "Nika"
};

function show(age) {
    console.log(`${this.name} ${age}`);
}

const fn = show.bind(user, 10);

show.call({ name: "Ana" }, 12); // Ana 12
// ეს იმიტომ მოხდება რადგანაც ჩვენ .call() მეთოდი გამოვიყენეთ რითაც შევცვალედ შემდგომ ობიექტი და გადავეცით ასაკი ფუნქციიდან გამომდინარე 
fn(); // Nika 10
// გამოიტანა შემდეგი პასუხი რადგანაც მე-11 გაზზე ჩვენ გამოვიყენეთ .bind() მეთოდი რითაც ჩვენ ის ობიექტის ფუნქცია შევქმენიც რომელიც გვქონდა მე-7 ხაზზე შექმნილი 



