# 2) შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილი ასაკის მიხედვით დაადგენს, რომელი ასაკობრივი ჯგუფის წევრია ადამიანი.
# თუ ასაკი უარყოფითია — გამოიტანე: "არასწორი ასაკი"
# თუ ასაკი ნაკლებია 13-ზე — გამოიტანე: "ბავშვი"
# თუ ასაკი არის 13-დან 19-ის ჩათვლით — გამოიტანე: "თინეიჯერი"
# თუ ასაკი არის 20-დან 59-ის ჩათვლით — გამოიტანე: "ზრდასრული"
# თუ ასაკი არის 60 ან მეტი — გამოიტანე: "პენსიონერი"

age = int(input(" Enter your age: "))

if age < 0:
    print("არასწორი ასაკი")
elif age < 13:
    print("ბავშვი")
elif age <= 19:
    print("თინეიჯერი")
elif age <= 59:
    print("ზრდასრული")
else:
    print("პენსიონერია")